content/main/20211017163728-java.md
+++
title = "Java"
author = ["System Administrator"]
draft = false
+++

## Setup {#setup}


## Language {#language}


### Common syntax {#common-syntax}


#### Variable declare {#variable-declare}

<!--list-separator-->

-  unary Datatypes

    <!--list-separator-->

    -  Numeric

        ```java
        Int num = 2;
        Double numd = 2.9;
        ```

    <!--list-separator-->

    -  String

        ```java
        String str = "this is a stinrg";
        ```

    <!--list-separator-->

    -  Boolen

        ```java
        boolean bool = false;
        ```

<!--list-separator-->

-  List

    <!--list-separator-->

    -  Array

        ```java
        int [] myArray; //declare
        myArray = new int[5]; // create a new array object; Assign it to myArray
        myArray[0] = 100;
        int[] myArray ={100,200,3,4,5};
        int[] anArray = new int[5];

        String[] s = new String[100]; //initialization
        ```

        <!--list-separator-->

        -  Array method

            ```java
            //Length
            len=myArray.length;
            ```

        <!--list-separator-->

        -  Remove entry

            ```java
            array[4] = null
            ```

<!--list-separator-->

-  Struct/Object

<!--list-separator-->

-  Global

    ```java
    public static int x;
    ```


#### Control Flow {#control-flow}

<!--list-separator-->

-  loop

    <!--list-separator-->

    -  While

        ```java
        while (condition) {
            statement;
        }
        ```

        <!--list-separator-->

        -  Infinite loop

            ```java
            while(true){
                statment;
            }
            ```

    <!--list-separator-->

    -  For

        ```java
        for (init; conditionl; modification){
            statment;
        }
        ```

<!--list-separator-->

-  If else

    ```java
    if (condition){
        statements;
    }
    else if (condition) {
        statements;
    }
    else {
        statements;
    }
    ```


#### Arithmetic {#arithmetic}

`/` for division, `%` for mod

<!--list-separator-->

-  unary operator

    -   `a++` a=a+1
    -   `a+=1` a = a + 1

<!--list-separator-->

-  Boolean

    -   and: `a&&b`
    -   or: `a||b`
    -   not: `!a`

<!--list-separator-->

-  Comparison

    -   `==` for equal

<!--list-separator-->

-  Other Math

    use Math object

    ```java
    Math.sqrt(4);
    Math.pow(2,4); // the 4th power of 2
    Math.hypot(3,4) = 5
        Math.floor(); //floor to integer
    ```


#### Function call {#function-call}

See [Method](#method)


#### System input/output {#system-input-output}

<!--list-separator-->

-  `Scanner` opject

<!--list-separator-->

-  Use

    ```java
    import java.util.Scanner;
    Scanner kb = new Scanner(System.in);
    String next = kb.nextLine(); // invoke a wait for input
    ```


#### Conversion between types {#conversion-between-types}

<!--list-separator-->

-  Cast

    ```java
    double a = 2.4;
    int b = (int) a

    ```

<!--list-separator-->

-  Wrapper Class methods

    \#+begin_src java
    Integer.parseInt(string s)
    string str = Integer.toString(res)
    \#+end_src&gt;


### Module {#module}


### Class {#class}


#### Method {#method}

```java
public static int addTwoNum(){ //method header
    statement;
    return res;
}
public static void writeNum(int num){
    statement;
}
```


#### Call of Method {#call-of-method}

Inside Class: `writeNum(num);`
Outside Class: `C2.writeNum(num);`


#### Declare {#declare}

```java
public class Person{
    String name;
    public Person(Sring name){
	this.name = name
    }
}
```


#### Create object {#create-object}

```java
public static void main(String[] args){
    Person p1 = new Person("James bond")
}
```


#### Public and private {#public-and-private}

Private: for surcurity!

<!--list-separator-->

-  Private var and getter/setter function

    ```java
    private String name;
    public String getName(){
        return name;
    }
    ```


#### Static {#static}

only one instance.

```java
static String leader = herman;
```


#### compare {#compare}

<!--list-separator-->

-  .equals()

<!--list-separator-->

-  samePerson(Person that)


#### print: overriding toString() method {#print-overriding-tostring-method}


#### Overload {#overload}

Same name, different parmeter number


### OOP {#oop}


#### Inheritance {#inheritance}

<!--list-separator-->

-  superclass and subclass

    copying all codes of Swordsman class

    ```java
    public class Pillar extends Swordsman{

    }
    ```

    <!--list-separator-->

    -  Constructer

        use super() to call superclass' constructor and pass values

    <!--list-separator-->

    -  Override

        ```java
        @Override public int attackDamage(){
            return 10
        }
        ```

        `@Override` mark the method is a overriding method. could prevent typo mistakes


#### Polymorphism {#polymorphism}

```java
Swordsman kyojuro = new Pillar()
```

getter of Pillar specific variable would report compile error
However, Pillar-overided method could be called


### Char and String {#char-and-string}


#### Difference {#difference}

Char is primitive, String, like array, is refference
Char is 'a' with only one character


#### Construct String like a objectt {#construct-string-like-a-objectt}

\#+begin_src java
string cosmo = new String("Hallo");
\#+end_src&gt;


#### char test {#char-test}

```java
Character.isLetter(firstLetter);
```


#### String methods {#string-methods}

<!--list-separator-->

-  Methods

    <!--list-separator-->

    -  Substring(

    <!--list-separator-->

    -  Error avoid measure

        use a if statement

        ```java
        if (str.length() >= 5){
            prefix = str.substring(0.5)
        }
        ```

    <!--list-separator-->

    -  equals()

        SourceString.equalsIgnoreCase(targetString) ignores the case

    <!--list-separator-->

    -  toUpperCase()

    <!--list-separator-->

    -  Test

        cosmo.isEmpty()
        .contains()
        .startsWith()
        .endsWith()

    <!--list-separator-->

    -  charAt(int i)

        returns the char at index i

    <!--list-separator-->

    -  indexOf(string target)

        left to right
        -1 if not found
        case-sensitive
        lastIndexOf() to serach from right to left

        <!--list-separator-->

        -  fromIndex

            search begin at given fromIndex
            if is negative, from start of the string
            if &gt;len, return -1

    <!--list-separator-->

    -  Trim, split and Replace

        <!--list-separator-->

        -  trim

            remove head and tail whitespace

        <!--list-separator-->

        -  replace and replaceAll(string a, string b)

        <!--list-separator-->

        -  split

            \#+begin_src java
            String[] split(String delimiter);//like , - or :
            \#+end_src&gt;


### Exception {#exception}


#### Try-catch {#try-catch}

```java
try {

}
catch(NumberFormatException e){

}
```

NumberFormatException can also be `Exception`, the superclass

<!--list-separator-->

-  Ask for retry

    when ilegel input in metohd, try-catch, and in the cathc block, call the method again

<!--list-separator-->

-  catch exceptions

    -   `NumberFormatException`
    -   `ArrayIndexOutOtBoundsException`

<!--list-separator-->

-  Handleing and exit

    use `System.exit(0)`


#### Throw exception {#throw-exception}

\#+begin_src java
throw new IllegalArgumentException();
\#+end_src&gt;


#### Exception objects {#exception-objects}


####  {#d41d8c}


### Switch {#switch}

alternative of `if`

```java
switch(userChoice){
case 1:

case 2:
    statement;
    break

default:
    statement;
}
```


## GUI {#gui}

awt -&gt; swing &amp; swt -&gt; javafx &amp; flutter
<https://www.zhihu.com/question/323058868>

use qt.

other:

-   Qt Jambi
-   Apache Pivot